## Pandas Interpolate ()

 Pandas interpolate() function is used to fill (NaN) values in DataFrame and Series.
    It is Very Powerfull Function.
    It Uses various interpolation techniques.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('C:\\Users\\abhishek\\Downloads\\student_study_data.csv')
df

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0        65.0
1  02-01-2026      1002.0     10     NaN        NaN        70.0
2  03-01-2026         NaN     10     NaN        4.0        75.0
3  04-01-2026         NaN     10     NaN        1.0         NaN
4  05-01-2026      1005.0     10       B        5.0         NaN
5  06-01-2026         NaN     10       A        6.0         NaN
6  07-01-2026      1007.0     10       C        2.5        68.0
7  08-01-2026      1008.0     10       B        NaN        72.0
8  09-01-2026      1009.0     10       A        NaN        80.0
9  10-01-2026      1010.0     10       C        5.5        88.0

In [3]:
## It guess the missing value only numeric value not string.
df.interpolate()

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\2755225419.py:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0       73.25
4  05-01-2026      1005.0     10       B        5.0       71.50
5  06-01-2026      1006.0     10       A        6.0       69.75
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

### Method Linear Interpolation

In [4]:
df.interpolate(method = 'linear')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\899569268.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method = 'linear')

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0       73.25
4  05-01-2026      1005.0     10       B        5.0       71.50
5  06-01-2026      1006.0     10       A        6.0       69.75
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

In [5]:
type(df.Date[0])

str

In [22]:
df.interpolate(methods = 'time')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\2388985931.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(methods = 'time')

            Date  Student ID Section  Study Hrs  Percentage
Class
10    2026-01-01      1001.0       A        2.0       65.00
10    2026-02-01      1002.0     NaN        3.0       70.00
10    2026-03-01      1003.0     NaN        4.0       75.00
10    2026-04-01      1004.0     NaN        1.0       73.25
10    2026-05-01      1005.0       B        5.0       71.50
10    2026-06-01      1006.0       A        6.0       69.75
10    2026-07-01      1007.0       C        2.5       68.00
10    2026-08-01      1008.0       B        3.5       72.00
10    2026-09-01      1009.0       A        4.5       80.00
10    2026-10-01      1010.0       C        5.5       88.00

### Changing format of date dd/mm/yy  to yy/dd/mm

In [7]:
df = pd.read_csv('C:\\Users\\abhishek\\Downloads\\student_study_data.csv',parse_dates =['Date'])
df

        Date  Student ID  Class Section  Study Hrs  Percentage
0 2026-01-01      1001.0     10       A        2.0        65.0
1 2026-02-01      1002.0     10     NaN        NaN        70.0
2 2026-03-01         NaN     10     NaN        4.0        75.0
3 2026-04-01         NaN     10     NaN        1.0         NaN
4 2026-05-01      1005.0     10       B        5.0         NaN
5 2026-06-01         NaN     10       A        6.0         NaN
6 2026-07-01      1007.0     10       C        2.5        68.0
7 2026-08-01      1008.0     10       B        NaN        72.0
8 2026-09-01      1009.0     10       A        NaN        80.0
9 2026-10-01      1010.0     10       C        5.5        88.0

In [8]:
type(df.Date[0])  # DATA TYOE CHANGE

pandas._libs.tslibs.timestamps.Timestamp

In [9]:
df = pd.read_csv('C:\\Users\\abhishek\\Downloads\\student_study_data.csv',parse_dates =['Date'], index_col = 'Date')
df

            Student ID  Class Section  Study Hrs  Percentage
Date
2026-01-01      1001.0     10       A        2.0        65.0
2026-02-01      1002.0     10     NaN        NaN        70.0
2026-03-01         NaN     10     NaN        4.0        75.0
2026-04-01         NaN     10     NaN        1.0         NaN
2026-05-01      1005.0     10       B        5.0         NaN
2026-06-01         NaN     10       A        6.0         NaN
2026-07-01      1007.0     10       C        2.5        68.0
2026-08-01      1008.0     10       B        NaN        72.0
2026-09-01      1009.0     10       A        NaN        80.0
2026-10-01      1010.0     10       C        5.5        88.0

### Interpolate Method

In [10]:
df.interpolate(method = 'time')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\3099140417.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method = 'time')

             Student ID  Class Section  Study Hrs  Percentage
Date
2026-01-01  1001.000000     10       A   2.000000   65.000000
2026-02-01  1002.000000     10     NaN   3.050847   70.000000
2026-03-01  1002.943820     10     NaN   4.000000   75.000000
2026-04-01  1003.988764     10     NaN   1.000000   73.221311
2026-05-01  1005.000000     10       B   5.000000   71.500000
2026-06-01  1006.016393     10       A   6.000000   69.721311
2026-07-01  1007.000000     10       C   2.500000   68.000000
2026-08-01  1008.000000     10       B   3.510870   72.000000
2026-09-01  1009.000000     10       A   4.521739   80.000000
2026-10-01  1010.000000     10       C   5.500000   88.000000

### Interpolate Index Method

In [11]:
df = pd.read_csv('C:\\Users\\abhishek\\Downloads\\student_study_data.csv',parse_dates =['Date'], index_col = 'Class')
df

            Date  Student ID Section  Study Hrs  Percentage
Class
10    2026-01-01      1001.0       A        2.0        65.0
10    2026-02-01      1002.0     NaN        NaN        70.0
10    2026-03-01         NaN     NaN        4.0        75.0
10    2026-04-01         NaN     NaN        1.0         NaN
10    2026-05-01      1005.0       B        5.0         NaN
10    2026-06-01         NaN       A        6.0         NaN
10    2026-07-01      1007.0       C        2.5        68.0
10    2026-08-01      1008.0       B        NaN        72.0
10    2026-09-01      1009.0       A        NaN        80.0
10    2026-10-01      1010.0       C        5.5        88.0

In [15]:
df = pd.read_csv('C:\\Users\\abhishek\\Downloads\\student_study_data.csv',parse_dates =['Date'], index_col = 'Class')

In [17]:
df.interpolate(methods  = 'index')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\3137247907.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(methods  = 'index')

            Date  Student ID Section  Study Hrs  Percentage
Class
10    2026-01-01      1001.0       A        2.0       65.00
10    2026-02-01      1002.0     NaN        3.0       70.00
10    2026-03-01      1003.0     NaN        4.0       75.00
10    2026-04-01      1004.0     NaN        1.0       73.25
10    2026-05-01      1005.0       B        5.0       71.50
10    2026-06-01      1006.0       A        6.0       69.75
10    2026-07-01      1007.0       C        2.5       68.00
10    2026-08-01      1008.0       B        3.5       72.00
10    2026-09-01      1009.0       A        4.5       80.00
10    2026-10-01      1010.0       C        5.5       88.00

### Interpolate Nearest Method

In [18]:
df.interpolate(methods  = 'nearest')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\502919409.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(methods  = 'nearest')

            Date  Student ID Section  Study Hrs  Percentage
Class
10    2026-01-01      1001.0       A        2.0       65.00
10    2026-02-01      1002.0     NaN        3.0       70.00
10    2026-03-01      1003.0     NaN        4.0       75.00
10    2026-04-01      1004.0     NaN        1.0       73.25
10    2026-05-01      1005.0       B        5.0       71.50
10    2026-06-01      1006.0       A        6.0       69.75
10    2026-07-01      1007.0       C        2.5       68.00
10    2026-08-01      1008.0       B        3.5       72.00
10    2026-09-01      1009.0       A        4.5       80.00
10    2026-10-01      1010.0       C        5.5       88.00

### Interpolate Polynomial Method

In [20]:
df.interpolate (methods = 'polynomial', order =2)

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\3751775317.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate (methods = 'polynomial', order =2)

            Date  Student ID Section  Study Hrs  Percentage
Class
10    2026-01-01      1001.0       A        2.0       65.00
10    2026-02-01      1002.0     NaN        3.0       70.00
10    2026-03-01      1003.0     NaN        4.0       75.00
10    2026-04-01      1004.0     NaN        1.0       73.25
10    2026-05-01      1005.0       B        5.0       71.50
10    2026-06-01      1006.0       A        6.0       69.75
10    2026-07-01      1007.0       C        2.5       68.00
10    2026-08-01      1008.0       B        3.5       72.00
10    2026-09-01      1009.0       A        4.5       80.00
10    2026-10-01      1010.0       C        5.5       88.00

In [21]:
df.interpolate (methods = 'spline', order =2)

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\2269803629.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate (methods = 'spline', order =2)

            Date  Student ID Section  Study Hrs  Percentage
Class
10    2026-01-01      1001.0       A        2.0       65.00
10    2026-02-01      1002.0     NaN        3.0       70.00
10    2026-03-01      1003.0     NaN        4.0       75.00
10    2026-04-01      1004.0     NaN        1.0       73.25
10    2026-05-01      1005.0       B        5.0       71.50
10    2026-06-01      1006.0       A        6.0       69.75
10    2026-07-01      1007.0       C        2.5       68.00
10    2026-08-01      1008.0       B        3.5       72.00
10    2026-09-01      1009.0       A        4.5       80.00
10    2026-10-01      1010.0       C        5.5       88.00

In [32]:
df = pd.read_csv('C:\\Users\\abhishek\\Downloads\\student_study_data.csv')
df

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0        65.0
1  02-01-2026      1002.0     10     NaN        NaN        70.0
2  03-01-2026         NaN     10     NaN        4.0        75.0
3  04-01-2026         NaN     10     NaN        1.0         NaN
4  05-01-2026      1005.0     10       B        5.0         NaN
5  06-01-2026         NaN     10       A        6.0         NaN
6  07-01-2026      1007.0     10       C        2.5        68.0
7  08-01-2026      1008.0     10       B        NaN        72.0
8  09-01-2026      1009.0     10       A        NaN        80.0
9  10-01-2026      1010.0     10       C        5.5        88.0

### Axis Parameter

In [46]:
df.interpolate()   #by default (0)

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\2647797613.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()   #by default (0)

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0       73.25
4  05-01-2026      1005.0     10       B        5.0       71.50
5  06-01-2026      1006.0     10       A        6.0       69.75
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

In [34]:
df.dtypes

Date           object
Student ID    float64
Class           int64
Section        object
Study Hrs     float64
Percentage    float64
dtype: object

### Limit Parameter (Forward,Backward,Both)

In [35]:
df.interpolate(limit = 1)   #filled only one NaN value

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\389352860.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit = 1)   #filled only one NaN value

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026         NaN     10     NaN        1.0       73.25
4  05-01-2026      1005.0     10       B        5.0         NaN
5  06-01-2026      1006.0     10       A        6.0         NaN
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        NaN       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

In [36]:
df.interpolate(limit = 2)

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\3004421978.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit = 2)

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0       73.25
4  05-01-2026      1005.0     10       B        5.0       71.50
5  06-01-2026      1006.0     10       A        6.0         NaN
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

### Limit_direction Parameter

In [37]:
df.interpolate(limit = 1, limit_direction ='backward')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\4250850655.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit = 1, limit_direction ='backward')

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026         NaN     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0         NaN
4  05-01-2026      1005.0     10       B        5.0         NaN
5  06-01-2026      1006.0     10       A        6.0       69.75
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        NaN       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

In [38]:
df.interpolate(limit = 2, limit_direction ='backward')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\3882630200.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit = 2, limit_direction ='backward')

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0         NaN
4  05-01-2026      1005.0     10       B        5.0       71.50
5  06-01-2026      1006.0     10       A        6.0       69.75
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

In [39]:
df.interpolate(limit = 1, limit_direction ='both')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\3360787840.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit = 1, limit_direction ='both')

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0       73.25
4  05-01-2026      1005.0     10       B        5.0         NaN
5  06-01-2026      1006.0     10       A        6.0       69.75
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

### Limit_area Parameter

In [40]:
df.interpolate(limit_area ='inside')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\521470443.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit_area ='inside')

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0       73.25
4  05-01-2026      1005.0     10       B        5.0       71.50
5  06-01-2026      1006.0     10       A        6.0       69.75
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

In [41]:
df.interpolate(limit_area ='outside')

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\1324320141.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit_area ='outside')

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0        65.0
1  02-01-2026      1002.0     10     NaN        NaN        70.0
2  03-01-2026         NaN     10     NaN        4.0        75.0
3  04-01-2026         NaN     10     NaN        1.0         NaN
4  05-01-2026      1005.0     10       B        5.0         NaN
5  06-01-2026         NaN     10       A        6.0         NaN
6  07-01-2026      1007.0     10       C        2.5        68.0
7  08-01-2026      1008.0     10       B        NaN        72.0
8  09-01-2026      1009.0     10       A        NaN        80.0
9  10-01-2026      1010.0     10       C        5.5        88.0

### Inplace Parameter

In [42]:
df

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0        65.0
1  02-01-2026      1002.0     10     NaN        NaN        70.0
2  03-01-2026         NaN     10     NaN        4.0        75.0
3  04-01-2026         NaN     10     NaN        1.0         NaN
4  05-01-2026      1005.0     10       B        5.0         NaN
5  06-01-2026         NaN     10       A        6.0         NaN
6  07-01-2026      1007.0     10       C        2.5        68.0
7  08-01-2026      1008.0     10       B        NaN        72.0
8  09-01-2026      1009.0     10       A        NaN        80.0
9  10-01-2026      1010.0     10       C        5.5        88.0

In [44]:
df.interpolate(inplace =True)
df

C:\Users\abhishek\AppData\Local\Temp\ipykernel_23704\478000531.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(inplace =True)

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0       73.25
4  05-01-2026      1005.0     10       B        5.0       71.50
5  06-01-2026      1006.0     10       A        6.0       69.75
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00

In [45]:
df

         Date  Student ID  Class Section  Study Hrs  Percentage
0  01-01-2026      1001.0     10       A        2.0       65.00
1  02-01-2026      1002.0     10     NaN        3.0       70.00
2  03-01-2026      1003.0     10     NaN        4.0       75.00
3  04-01-2026      1004.0     10     NaN        1.0       73.25
4  05-01-2026      1005.0     10       B        5.0       71.50
5  06-01-2026      1006.0     10       A        6.0       69.75
6  07-01-2026      1007.0     10       C        2.5       68.00
7  08-01-2026      1008.0     10       B        3.5       72.00
8  09-01-2026      1009.0     10       A        4.5       80.00
9  10-01-2026      1010.0     10       C        5.5       88.00